# НЕ используя методы find() и rfind(), напиши программу,
# которая находит индекс второго вхождения символа symbol
# в неё и выводит его на экран. Если символ встречается один раз,
# программа должна вернуть -1, а если ни одного — вернуть -2.
# Не обязательно: для удобство можно реализовать методы

# Количество символов в слове
def count(word, symbol):
    pass


# Индекс первого вхождения символа в слово
def find(word, symbol):
    pass


# Индекс N-го вхождения символа в слово
def finder(word, symbol, n):
    pass
