# ____________МНОЖЕСТВА_______________
# s1 = set()
# s2 = {1, 2, 3, 4, 5, 5, 5, 5}
#
# print(s2)
#
# s2.add(6)
# s2.add(7)
# s2.add(8)
# s2.add(5)
# print(s2)
#
# l1 = [1, 2, 3, 4, 5, 6]
#
# if 1 in l1:
#     print('Число 1 находится в списке')
#
# if 1 in s2:
#     print('Число 1 находится в множестве')

# ____________СЛОВАРИ________________
# d1 = dict()
# d2 = {}
#
# d3 = {
#     'Леша': 20,
#     'Олег': 24,
#     'Озарби': 5,
# }
# print(d3['Леша'])
# print(d3['Олег'])
# print(d3['Озарби'])
#
# d3['Лена'] = 68
#
# print(d3['Лена'])
# print(d3)
#
# if 'Лена' in d3:
#     print(d3['Лена'])
# else:
#     print('Лена не в словаре')