token = "1507529984:AAExQk0uRILL2Rd7qLT6P5yFSuLIB2GVOnQ"


class MsgReply:
    greeting = "Привет, {}! \nЯ бот для отслеживания твоих вредных привычек.\nЯ помогу тебя урегулировать твои вредные " \
               "привычки, давай начнём!\nВыбери инетересующую тебя привычку. "
    helping = "Напиши команду /start, узнать о боте.\nНапиши команду /clear, чтобы очить всю информацию о себе в " \
              "памяти бота "
    clearing_apply = "Информация о вас была успешно удалена."
    clearing_cancel = "Ты еще не стал на путь исправления"
