class MsgReply:
    greeting_apply = "Привет, {}! \nЯ бот для отслеживания твоих вредных привычек.\nЯ помогу тебe урегулировать твои " \
                     "вредные привычки, давай начнём!\nВыбери инетересующую тебя привычку. "
    greeting_cancel = "Ты уже встал на путь истинный, пора указать свои вредные привычки"
    helping = "Напиши команду /start, узнать о боте.\nНапиши команду /clear, чтобы очить всю информацию о себе в " \
              "памяти бота "
    clearing_apply = "Информация о вас была успешно удалена."
    clearing_cancel = "Ты еще не стал на путь исправления"


class MsgWord:
    alcohol = "Алкоголь"
    smoking = "Курение"
    junk_food = "Джанкфуд"